// See https://aka.ms/new-console-template for more information
//Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
//5 -> 2, 4
//8 -> 2, 4, 6, 8
// 
Console.WriteLine("Введите число число: ");
int number = int.Parse( s:Console.ReadLine());
if(number >  0 )
{
    for(int i = 0 ; i <= number )
    {
      if((number % 2) == 0)
    {
            Console.WriteLine($"Числа ")
    }  
    }
   
}
